share/tutorials/incompressible/porous-simple/angled_duct_explicit/constant/turbulenceProperties
// mousse: CFD toolbox

FoamFile
{
 version     2.0;
 format      ascii;
 class       dictionary;
 location    "constant";
 object      turbulenceProperties;
}

simulationType RAS;
RAS
{
 RASModel        kEpsilon;
 turbulence      on;
 printCoeffs     on;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
