share/tutorials/incompressible/porous-simple/angled_duct_explicit/0/T
// mousse: CFD toolbox

FoamFile
{
 version     2.0;
 format      ascii;
 class       volScalarField;
 object      T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 293;

boundaryField
{
 front
 {
  type            zeroGradient;
 }
 back
 {
  type            zeroGradient;
 }
 walls
 {
  type            zeroGradient;
 }
 porosityWall
 {
  type            zeroGradient;
 }
 inlet
 {
  type            fixedValue;
  value           $internalField;
 }
 outlet
 {
  type            inletOutlet;
  value           $internalField;
  inletValue      $internalField;
 }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
