share/tutorials/incompressible/porous-simple/angled_duct_explicit/0/k
// mousse: CFD toolbox

FoamFile
{
 version     2.0;
 format      ascii;
 class       volScalarField;
 location    "0";
 object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 1;

boundaryField
{
 front
 {
  type            kqRWallFunction;
  value           uniform 1;
 }
 back
 {
  type            kqRWallFunction;
  value           uniform 1;
 }
 walls
 {
  type            kqRWallFunction;
  value           uniform 1;
 }
 porosityWall
 {
  type            kqRWallFunction;
  value           uniform 1;
 }
 inlet
 {
  type            turbulentIntensityKineticEnergyInlet;
  intensity       0.05;
  value           uniform 1;
 }
 outlet
 {
  type            inletOutlet;
  inletValue      uniform 1;
  value           uniform 1;
 }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
