share/tutorials/incompressible/porous-simple/angled_duct_explicit/system/fvSchemes
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSchemes;
}

ddtSchemes
{
  default         steadyState;
}
gradSchemes
{
  default         Gauss linear;
}
divSchemes
{
  default         none;
  div(phi,U)      bounded Gauss upwind;
  div((nuEff*dev2(T(grad(U))))) Gauss linear;
  div(phi,epsilon) bounded Gauss upwind;
  div(phi,k)      bounded Gauss upwind;
}
laplacianSchemes
{
  default         Gauss linear corrected;
}
interpolationSchemes
{
  default         linear;
}
snGradSchemes
{
  default         corrected;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
